tap "gromgit/brewtils"
tap "jandedobbeleer/oh-my-posh"
tap "nikitabobko/tap"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Prompt theme engine for any shell
brew "oh-my-posh"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Scriptable music downloader for Qobuz, Tidal, SoundCloud, and Deezer
brew "streamrip"
# Vi 'workalike' with many additional features
brew "vim"
# Interactive TUI for Homebrew
brew "gromgit/brewtils/taproom"
# Application uninstaller
cask "appcleaner"
# Menu bar icon organiser
cask "bartender"
# Anthropic's official Claude AI desktop app
cask "claude"
# Voice and text chat software
cask "discord"
# Calendar software
cask "fantastical"
# Audio player
cask "foobar2000"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Utility that shows the latest app updates
cask "latest"
# VPN client
cask "mullvad-vpn"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Home media player
cask "plex"
# Catalogue of hi-res music for streaming and download
cask "qobuz"
# Control your tools with a few keystrokes
cask "raycast"
# Disposable email client
cask "tempbox"
# Unpacks archive files
cask "the-unarchiver"
# Open-source code editor
cask "visual-studio-code"
# Multiplayer code editor
cask "zed"
# Gecko based web browser
cask "zen"
